# YOLOv5 Student Model Configuration 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 80  # number of classes (update if using a custom dataset with fewer/more classes)
depth_multiple: 0.33  # model depth multiple (kept the same as YOLOv5s)
width_multiple: 0.50  # layer channel multiple (reduces channels by ~50%)
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 Student Model - backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 6, 2, 2]],       # 0-P1/2 (reduced from 64 to 32 channels)
   [-1, 1, Conv, [64, 3, 2]],          # 1-P2/4 (reduced from 128 to 64 channels)
   [-1, 3, C3, [64]],                  # 2
   [-1, 1, Conv, [128, 3, 2]],         # 3-P3/8 (reduced from 256 to 128 channels)
   [-1, 6, C3, [128]],                 # 4
   [-1, 1, Conv, [256, 3, 2]],         # 5-P4/16 (reduced from 512 to 256 channels)
   [-1, 6, C3, [256]],                 # 6 (reduced from 9 to 6 C3 modules for lightweight)
   [-1, 1, Conv, [512, 3, 2]],         # 7-P5/32 (reduced from 1024 to 512 channels)
   [-1, 3, C3, [512]],                 # 8
   [-1, 1, SPPF, [512, 5]],            # 9 (reduced from 1024 to 512 channels)
  ]

# YOLOv5 v6.0 Student Model - head
head:
  [[-1, 1, Conv, [256, 1, 1]],         # 10 (reduced from 512 to 256 channels)
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 11
   [[-1, 6], 1, Concat, [1]],          # 12 - concatenate with backbone P4
   [-1, 3, C3, [256, False]],          # 13 (reduced from 512 to 256 channels)

   [-1, 1, Conv, [128, 1, 1]],         # 14 (reduced from 256 to 128 channels)
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 15
   [[-1, 4], 1, Concat, [1]],          # 16 - concatenate with backbone P3
   [-1, 3, C3, [128, False]],          # 17 (reduced from 256 to 128 channels)

   [-1, 1, Conv, [128, 3, 2]],         # 18 (downsample back to P4)
   [[-1, 13], 1, Concat, [1]],         # 19 - concatenate with head P4
   [-1, 3, C3, [256, False]],          # 20 (reduced from 512 to 256 channels)

   [-1, 1, Conv, [256, 3, 2]],         # 21 (downsample back to P5)
   [[-1, 8], 1, Concat, [1]],          # 22 - concatenate with head P5
   [-1, 3, C3, [512, False]],          # 23 (reduced from 1024 to 512 channels)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
