# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 80  # number of classes (update this to the number of classes in your dataset)
depth_multiple: 0.2475  # 0.33 * 0.75 (scaled depth)
width_multiple: 0.1875  # 0.25 * 0.75 (scaled width)
anchors:
  - [7,10, 12,22, 24,16]  # P3/8 (scaled for smaller model)
  - [21,41, 42,31, 39,78]  # P4/16 (scaled for smaller model)
  - [87,66, 118,150, 280,244]  # P5/32 (scaled for smaller model)

# YOLOv5n 0.75x Backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [48, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [96, 3, 2]],  # 1-P2/4
   [-1, 2, C3, [96]],  # 2-P2
   [-1, 1, Conv, [192, 3, 2]],  # 3-P3/8
   [-1, 4, C3, [192]],  # 4-P3
   [-1, 1, Conv, [384, 3, 2]],  # 5-P4/16
   [-1, 6, C3, [384]],  # 6-P4
   [-1, 1, Conv, [768, 3, 2]],  # 7-P5/32
   [-1, 2, C3, [768]],  # 8-P5
   [-1, 1, SPPF, [768, 5]],  # 9-SPPF
  ]

# YOLOv5n 0.75x Head
head:
  [[-1, 1, Conv, [384, 1, 1]],  # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 11
   [[-1, 5], 1, Concat, [1]],  # cat backbone P4
   [-1, 2, C3, [384, False]],  # 13

   [-1, 1, Conv, [192, 1, 1]],  # 14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 15
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 2, C3, [192, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [192, 3, 2]],  # 18
   [[-1, 13], 1, Concat, [1]],  # cat head P4
   [-1, 2, C3, [384, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [384, 3, 2]],  # 21
   [[-1, 9], 1, Concat, [1]],  # cat head P5
   [-1, 2, C3, [768, False]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
